#include "Func.h"


int main()
{
    setlocale(LC_ALL, "rus");
	std::vector<Book> Library = {{"Война и мир", "Лев Толстой", "Издательство АСТ", "Роман"},
                                 {"Преступление и наказание", "Фёдор Достоевский", "Издательство Наука", "Роман"},
                                 {"Мастер и Маргарита", "Михаил Булгаков", "Издательство Эксмо", "Роман"},
                                 {"Анна Каренина", "Лев Толстой", "Издательство Азбука", "Роман"},
                                 {"Идиот", "Фёдор Достоевский", "Издательство АСТ", "Роман"},
                                 {"Собачье сердце", "Михаил Булгаков", "Издательство Эксмо", "Повесть"},
                                 {"Отцы и дети", "Иван Тургенев", "Издательство Азбука", "Роман"},
                                 {"Герой нашего времени", "Михаил Лермонтов", "Издательство Наука", "Роман"},
                                 {"Обломов", "Иван Гончаров", "Издательство АСТ", "Роман"},
                                 {"Мёртвые души", "Николай Гоголь", "Издательство Эксмо", "Поэма"}
        };
    Book* book = FindBook(Library, "Война и мир");
    std::cout << book->title << std::endl;
    SortByTitle(Library);
    SortByAuthor(Library);
    SortByPublisher(Library);
}