#include <iostream>
#include "Func.h"	
int main()
{
	/*
	Написать функцию, которая принимает два	параметра: основание степени и
	показатель степени, и вычисляет степень числа на основе полученных данных
	*/
	std::cout << MyPow(10, 3);
}