#include <iostream>
#include "SumFromTo.h"

int main()
{
	/*
		Написать функцию, которая получает в качестве 
		параметров 2 целых числа и возвращает сумму 
		чисел из диапазона между ними
	*/

	std::cout << SumFromTo(10, 20);
}